BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_SPI.c
// CRC: 5D982BB222882C54AB4AFF20A1590FC484D3178BD0D2510D0F5A64A7853221CAE2C33FABBE4F69A6659399D51781B7B962C5EB630D1FECDDCBEF1BA7CAEA61529A0D46BD3B6AACB92DE4D84759EBB5079CA9DA2D2BBCDAE2A4D1C56CD1580BF52132E60E2F83633AAEE42AECC2716E8F9B97968B46850D05B11FABA7FA747DEB8AF9254373EFEEC10C402CEF61DDF0938EEB578029F1ABDC8F22D5FB9CB3F24C123F9263CE2D18A76A9D8191DDEE02994236C4BB413250AA549D34A0D5AD11F3D80C5D7DEE0EA1E77BA796A6972DDEA75386E3E6C330420D1EF3C8BA6D793B2D3FD0D9AB4C2F44A0
// REVISION: 1.0
// GUID: 3021E4EA-0FB8-43C3-A3EB-86D3A1E52F2F
// DATE: 08\08\2022
// DIR: CAL\PIC16BIT\PIC16BIT_CAL_SPI.c
/*********************************************************************
 *                  Flowcode CAL SPI File
 *
 * File: PIC16BIT_CAL_SPI.c
 *
 * (c) 2011 Matrix Multimedia Ltd.
 * http://www.matrixmultimedia.com
 *
 * Software License Agreement
 *
 * The software supplied herewith by Matrix Multimedia Ltd (the
 * “Company”) for its Flowcode graphical programming language is
 * intended and supplied to you, the Company’s customer, for use
 * solely and exclusively on the Company's products. The software
 * is owned by the Company, and is protected under applicable
 * copyright laws. All rights are reserved. Any use in violation
 * of the foregoing restrictions may subject the user to criminal
 * sanctions under applicable laws, as well as to civil liability
 * for the breach of the terms and conditions of this licence.
 *
 * THIS SOFTWARE IS PROVIDED IN AN “AS IS” CONDITION. NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 * TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 * IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * Changelog:
 *
 *  date  | by | description
 * -------+----+-----------------------------------------------------
 * 090911 | BR | Created
 * 050312 | BR | Updated to v5.1 CAL Schema
 * 200712 | BR | Added new macro to configure prescaler on the fly
 * 090812 | ST | Fixed initial clock polarity setting
 * 090812 | ST | Added comments to explain the BMODE settings and Master_Byte function
 * 170812 | BR | Removed unneeded #endif statements
 * 070912 | BR | Changed Remappable Functionality to be loaded from FCD
 * 110912 | BR | Added minor mod for SPI channel 2,3 and 4 for MX_SPICON devices
 * 140912 | BR | Chaned prescaler function to tie in with the FAT component
 * 181012 | LM | Dummy read to clear flags
 * 210613 | BR | Bug fix defines mod for HW SPI Prescaler - also related mods to init
 * 030713 | LM | Standard API calls
 * 280813 | LM | Removed MX_SPI_x define checks
 * 011214 | LM | dsPIC Manual: The SMP bit must be set only after setting the MSTEN bit.
 * 220118 | LM | Add transaction functions
 *
 */



//When using hardware SPI channels override port and pin conns with FCD conn definitions
//Only overwrite CS pin defines when using SPI in slave mode on a hardware channel
//Also sort out postscale and prescale options for hardware channels

#define MX_SPI_REF_X				CAL_APPEND(MX_SPI_REF, MX_SPI_NUM)
#define MX_SPI_CHANNEL_X			CAL_APPEND(MX_SPI_CHANNEL_, MX_SPI_NUM)
#define MX_SPI_MOSI_PIN_X			CAL_APPEND(MX_SPI_MOSI_PIN_, MX_SPI_NUM)
#define MX_SPI_MOSI_PORT_X			CAL_APPEND(MX_SPI_MOSI_PORT_, MX_SPI_NUM)
#define MX_SPI_MOSI_TRIS_X			CAL_APPEND(MX_SPI_MOSI_TRIS_, MX_SPI_NUM)
#define MX_SPI_MISO_PIN_X			CAL_APPEND(MX_SPI_MISO_PIN_, MX_SPI_NUM)
#define MX_SPI_MISO_PORT_X			CAL_APPEND(MX_SPI_MISO_PORT_, MX_SPI_NUM)
#define MX_SPI_MISO_TRIS_X			CAL_APPEND(MX_SPI_MISO_TRIS_, MX_SPI_NUM)
#define MX_SPI_SCK_PIN_X			CAL_APPEND(MX_SPI_SCK_PIN_, MX_SPI_NUM)
#define MX_SPI_SCK_PORT_X			CAL_APPEND(MX_SPI_SCK_PORT_, MX_SPI_NUM)
#define MX_SPI_SCK_TRIS_X			CAL_APPEND(MX_SPI_SCK_TRIS_, MX_SPI_NUM)
#define MX_SPI_CS_PIN_X				CAL_APPEND(MX_SPI_CS_PIN_, MX_SPI_NUM)
#define MX_SPI_CS_PORT_X			CAL_APPEND(MX_SPI_CS_PORT_, MX_SPI_NUM)
#define MX_SPI_CS_TRIS_X			CAL_APPEND(MX_SPI_CS_TRIS_, MX_SPI_NUM)
#define MX_SPI_BMODE_X				CAL_APPEND(MX_SPI_BMODE_, MX_SPI_NUM)
#define MX_SPI_PR_SCALE_X			CAL_APPEND(MX_SPI_PR_SCALE_, MX_SPI_NUM)
#define MX_SPI_PO_SCALE_X			CAL_APPEND(MX_SPI_PO_SCALE_, MX_SPI_NUM)
#define MX_SPI_INT_X				CAL_APPEND(MX_SPI_INT_, MX_SPI_NUM)
#define MX_SPI_REMAPPABLE_X			CAL_APPEND(MX_SPI_REMAPPABLE_, MX_SPI_NUM)
#define MX_SPI_MISO_RPINR_X			CAL_APPEND(MX_SPI_MISO_RPINR_, MX_SPI_NUM)
#define MX_SPI_MISO_RP_X			CAL_APPEND(MX_SPI_MISO_RP_, MX_SPI_NUM)
#define MX_SPI_MOSI_RPOR_X			CAL_APPEND(MX_SPI_MOSI_RPOR_, MX_SPI_NUM)
#define MX_SPI_MOSI_SDO_X			CAL_APPEND(MX_SPI_MOSI_SDO_, MX_SPI_NUM)
#define MX_SPI_CLK_RPOR_X			CAL_APPEND(MX_SPI_CLK_RPOR_, MX_SPI_NUM)
#define MX_SPI_CLK_SCK_X			CAL_APPEND(MX_SPI_CLK_SCK_, MX_SPI_NUM)
#define MX_SPI_CLK_RPINR_X			CAL_APPEND(MX_SPI_CLK_RPINR_, MX_SPI_NUM)
#define MX_SPI_CLK_RP_X				CAL_APPEND(MX_SPI_CLK_RP_, MX_SPI_NUM)
#define MX_SPI_USESS_X				CAL_APPEND(MX_SPI_USESS_, MX_SPI_NUM)
#define MX_SPI_SS_RPINR_X			CAL_APPEND(MX_SPI_SS_RPINR_, MX_SPI_NUM)
#define MX_SPI_SS_RP_X				CAL_APPEND(MX_SPI_SS_RP_, MX_SPI_NUM)
#define MX_SPI_SLAVE_X				CAL_APPEND(MX_SPI_SLAVE_, MX_SPI_NUM)
#define MX_SPI_SS_ALT_X				CAL_APPEND(MX_SPI_SS_ALT_, MX_SPI_NUM)
#define MX_SPI_SS_REG_X				CAL_APPEND(MX_SPI_SS_REG_, MX_SPI_NUM)
#define MX_SPI_SS_MSK_X				CAL_APPEND(MX_SPI_SS_MSK_, MX_SPI_NUM)
#define MX_SPI_SS_PIN_X				CAL_APPEND(MX_SPI_SS_PIN_, MX_SPI_NUM)
#define MX_SPI_SS_PORT_X			CAL_APPEND(MX_SPI_SS_PORT_, MX_SPI_NUM)
#define MX_SPI_SS_TRIS_X			CAL_APPEND(MX_SPI_SS_TRIS_, MX_SPI_NUM)

//Setup Definitions
#ifdef MX_SPI_REF_X
	#if MX_SPI_CHANNEL_X > 0
		#if MX_SPI_PR_SCALE_X == 2
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b11011
		#endif
		#if MX_SPI_PR_SCALE_X == 4
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b11110
		#endif
		#if MX_SPI_PR_SCALE_X == 6
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b01011
		#endif
		#if MX_SPI_PR_SCALE_X == 8
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b00011
		#endif
		#if MX_SPI_PR_SCALE_X == 12
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b10110
		#endif
		#if MX_SPI_PR_SCALE_X == 16
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b11101
		#endif
		#if MX_SPI_PR_SCALE_X == 20
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b01110
		#endif
		#if MX_SPI_PR_SCALE_X == 24
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b01010
		#endif
		#if MX_SPI_PR_SCALE_X == 28
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b00110
		#endif
		#if MX_SPI_PR_SCALE_X == 32
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b11001
		#endif
		#if MX_SPI_PR_SCALE_X == 48
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b10101
		#endif
		#if MX_SPI_PR_SCALE_X == 64
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b11100
		#endif
		#if MX_SPI_PR_SCALE_X == 128
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b11000
		#endif
		#if MX_SPI_PR_SCALE_X == 192
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b10100
		#endif
		#if MX_SPI_PR_SCALE_X == 256
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b10000
		#endif
		#if MX_SPI_PR_SCALE_X == 512
			#undef MX_SPI_PR_SCALE_X
			#define MX_SPI_PR_SCALE_X	0b00000
		#endif
	#endif
#endif


#define MX_PRESCALE_VAR_X		CAL_APPEND(prescale_, MX_SPI_NUM)

MX_UINT16 MX_PRESCALE_VAR_X = MX_SPI_PR_SCALE_X;


