BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_SPI.c
//Function Prototypes
CALFUNCTION(MX_UINT8, FC_CAL_SPI_Master_Init_, (void));
CALFUNCTION(void, FC_CAL_SPI_Master_Uninit_, (void));
CALFUNCTION(MX_UINT8, FC_CAL_SPI_Master_Byte_, (MX_UINT8 DataOut));
CALFUNCTION(void, FC_CAL_SPI_SetPrescaler_, (MX_UINT8 Prescaler));

CALFUNCTION(void, FC_CAL_SPI_Slave_Init_, (void));
CALFUNCTION(void, FC_CAL_SPI_Slave_Uninit_, (void));
CALFUNCTION(void, FC_CAL_SPI_Slave_SetTxData_, (MX_UINT8 Data));
CALFUNCTION(MX_UINT8, FC_CAL_SPI_Slave_GetRxData_, (void));

CALFUNCTION(MX_UINT8, FC_CAL_SPI_Transaction_Init_,   (void));
CALFUNCTION(MX_UINT8, FC_CAL_SPI_Transaction_,   (MX_UINT8* Buffer, MX_UINT16 Size, MX_UINT16 Length));
CALFUNCTION(void,     FC_CAL_SPI_Transaction_Uninit_, (void));


#ifdef MX_SPI1CON
	#define SPI1CON1		SPI1CON
	#define SPI1CON1bits	SPI1CONbits
	#define SPI2CON1		SPI2CON
	#define SPI2CON1bits	SPI2CONbits
	#define SPI3CON1		SPI3CON
	#define SPI3CON1bits	SPI3CONbits
	#define SPI4CON1		SPI4CON
	#define SPI4CON1bits	SPI4CONbits
#endif



//Bus Mode - Bit0=CKP=CPOL, Bit1=CKE=!CPHA, Bit2=CSMP
//CKP=CPOL - Clock Polarity - Idle State of the clock 0=0, 1=1
//CKE=CPHA - Clock Phase - Clock Edge 0=leading edge, 1=trailing edge
//CSMP - Input Data Bit Sample Phase
//CRAT - SPI Clock Rate 0=1/4, 1=1/16, 2=1/64

// There are 4 SPI clock modes as follows:
//
// SPI Mode | CKP (CPOL) | CKE (CPHA) | BMODE | Explanation
//----------+------------+--------------------+------------------------------------------------
//  1 (0,1) |  0   (0)   |  0   (1)   | xx00  | idle low;  data out on falling/trailing edge
//  3 (1,1) |  1   (1)   |  0   (1)   | xx01  | idle high; data out on rising/trailing edge
//  0 (0,0) |  0   (0)   |  1   (0)   | xx10  | idle low;  data out on rising/leading edge
//  2 (1,0) |  1   (1)   |  1   (0)   | xx11  | idle high; data out on falling/leading edge
//----------+------------+---------------------------------------------------------------------
//
// So:
//     BMODE & 0x01 = CKP =  CPOL
//     BMODE & 0x02 = CKE = !CPHA



#if (MX_SPI_SLAVE_X != 1)	//Master Start

CALFUNCTION(MX_UINT8, FC_CAL_SPI_Master_Init_, (void))
{
	MX_UINT8 retVal = 1;
	FC_CAL_Bit_High_DDR (MX_SPI_MOSI_PORT_X, MX_SPI_MOSI_TRIS_X, MX_SPI_MOSI_PIN_X);		// MOSI pin is default high
	FC_CAL_Bit_In_DDR   (MX_SPI_MISO_PORT_X, MX_SPI_MISO_TRIS_X, MX_SPI_MISO_PIN_X);		// MISO pin is a input

	#if (MX_SPI_BMODE_X & 0x01)
		FC_CAL_Bit_High_DDR (MX_SPI_SCK_PORT_X, MX_SPI_SCK_TRIS_X, MX_SPI_SCK_PIN_X);		// Clock pin is default high
	#else
		FC_CAL_Bit_Low_DDR  (MX_SPI_SCK_PORT_X, MX_SPI_SCK_TRIS_X, MX_SPI_SCK_PIN_X);		// Clock pin is default low
	#endif

	#if (MX_SPI_REMAPPABLE_X == 1)
		MX_SPI_MISO_RPINR_X = MX_SPI_MISO_RP_X;
		MX_SPI_MOSI_RPOR_X = MX_SPI_MOSI_SDO_X;
		MX_SPI_CLK_RPOR_X = MX_SPI_CLK_SCK_X;			//For some reason the SPI clock is not included in the remap on PIC32
	#endif

	#if (MX_SPI_CHANNEL_X == 1)

		SPI1CON1 = MX_SPI_PR_SCALE_X & 0x1F;					//Assign Clock Prescalers
		SPI1CON1bits.MSTEN = 1;									//master mode
		SPI1CON1bits.CKP = MX_SPI_BMODE_X & 0x01;				//Assign Clock Polarity
		SPI1CON1bits.CKE = (MX_SPI_BMODE_X & 0x02) >> 1;		//Assign Clock Phase
		SPI1CON1bits.SMP = (MX_SPI_BMODE_X & 0x04) >> 2;		//Assign Input Data Phase

		#ifdef SPI1STATL
			SPI1STATLbits.SPIROV = 0;							//clear unread data flag
			SPI1CON1bits.SPIEN = 1;								//enable SPI peripheral
		#else
			SPI1STATbits.SPIROV = 0;							//clear unread data flag
			SPI1STATbits.SPIEN = 1;								//enable SPI peripheral
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 2)

		SPI2CON1 = MX_SPI_PR_SCALE_X & 0x1F;					//Assign Clock Prescalers
		SPI2CON1bits.MSTEN = 1;									//master mode
		SPI2CON1bits.CKP = MX_SPI_BMODE_X & 0x01;				//Assign Clock Polarity
		SPI2CON1bits.CKE = (MX_SPI_BMODE_X & 0x02) >> 1;		//Assign Clock Phase
		SPI2CON1bits.SMP = (MX_SPI_BMODE_X & 0x04) >> 2;		//Assign Input Data Phase

		#ifdef SPI2STATL
			SPI2STATLbits.SPIROV = 0;							//clear unread data flag
			SPI2CON1bits.SPIEN = 1;								//enable SPI peripheral
		#else
			SPI2STATbits.SPIROV = 0;							//clear unread data flag
			SPI2STATbits.SPIEN = 1;								//enable SPI peripheral
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 3)

		SPI3CON1 = MX_SPI_PR_SCALE_X & 0x1F;					//Assign Clock Prescalers
		SPI3CON1bits.MSTEN = 1;									//master mode
		SPI3CON1bits.CKP = MX_SPI_BMODE_X & 0x01;				//Assign Clock Polarity
		SPI3CON1bits.CKE = (MX_SPI_BMODE_X & 0x02) >> 1;		//Assign Clock Phase
		SPI3CON1bits.SMP = (MX_SPI_BMODE_X & 0x04) >> 2;		//Assign Input Data Phase

		#ifdef SPI3STATL
			SPI3STATLbits.SPIROV = 0;							//clear unread data flag
			SPI3CON1bits.SPIEN = 1;								//enable SPI peripheral
		#else
			SPI3STATbits.SPIROV = 0;							//clear unread data flag
			SPI3STATbits.SPIEN = 1;								//enable SPI peripheral
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 4)

		SPI4CON1 = MX_SPI_PR_SCALE_X & 0x1F;					//Assign Clock Prescalers
		SPI4CON1bits.MSTEN = 1;									//master mode
		SPI4CON1bits.CKP = MX_SPI_BMODE_X & 0x01;				//Assign Clock Polarity
		SPI4CON1bits.CKE = (MX_SPI_BMODE_X & 0x02) >> 1;		//Assign Clock Phase
		SPI4CON1bits.SMP = (MX_SPI_BMODE_X & 0x04) >> 2;		//Assign Input Data Phase

		#ifdef SPI4STATL
			SPI4STATLbits.SPIROV = 0;							//clear unread data flag
			SPI4CON1bits.SPIEN = 1;								//enable SPI peripheral
		#else
			SPI4STATbits.SPIROV = 0;							//clear unread data flag
			SPI4STATbits.SPIEN = 1;								//enable SPI peripheral
		#endif

	#endif
	return (retVal);
}


CALFUNCTION(void, FC_CAL_SPI_Master_Uninit_, (void))
{
	#if (MX_SPI_CHANNEL_X == 1)
		#ifdef SPI1STATL
			SPI1CON1bits.SPIEN = 0;								//disable SPI peripheral
		#else
			SPI1STATbits.SPIEN = 0;								//disable SPI peripheral
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 2)
		#ifdef SPI2STATL
			SPI2CON1bits.SPIEN = 0;								//disable SPI peripheral
		#else
			SPI2STATbits.SPIEN = 0;								//disable SPI peripheral
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 3)
		#ifdef SPI3STATL
			SPI3CON1bits.SPIEN = 0;								//disable SPI peripheral
		#else
			SPI3STATbits.SPIEN = 0;								//disable SPI peripheral
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 4)
		#ifdef SPI4STATL
			SPI4CON1bits.SPIEN = 0;								//disable SPI peripheral
		#else
			SPI4STATbits.SPIEN = 0;								//disable SPI peripheral
		#endif
	#endif

	//Reset Pins to Inputs
	FC_CAL_Bit_In_DDR (MX_SPI_MOSI_PORT_X, MX_SPI_MOSI_TRIS_X, MX_SPI_MOSI_PIN_X);
	FC_CAL_Bit_In_DDR (MX_SPI_MISO_PORT_X, MX_SPI_MISO_TRIS_X, MX_SPI_MISO_PIN_X);
	FC_CAL_Bit_In_DDR (MX_SPI_SCK_PORT_X, MX_SPI_SCK_TRIS_X, MX_SPI_SCK_PIN_X);
}


CALFUNCTION(MX_UINT8, FC_CAL_SPI_Master_Byte_, (MX_UINT8 DataOut))
{
	MX_UINT8 retVal = 0;

	#if (MX_SPI_CHANNEL_X == 0)

		MX_UINT8 idx;
		MX_UINT16 i;
		for (idx = 0; idx < 8; idx++)
		{
			retVal = retVal << 1;

			//If mode 1 or 3, switch the clock
			#if ((MX_SPI_BMODE_X & 0x02) == 0x00)									//CKE = 0; (mode 1 or 3) Set SCK active before data
				#if ((MX_SPI_BMODE_X & 0x01) == 0x00)
					FC_CAL_Bit_High(MX_SPI_SCK_PORT_X, MX_SPI_SCK_PIN_X);			//CKP = 0; (mode 1)
				#else
					FC_CAL_Bit_Low(MX_SPI_SCK_PORT_X, MX_SPI_SCK_PIN_X);			//CKP = 1; (mode 3)
				#endif
			#endif

			//Data setup
			if (DataOut & 0x80)														//Test Data bit
				FC_CAL_Bit_High(MX_SPI_MOSI_PORT_X, MX_SPI_MOSI_PIN_X);				//Set SDO bit
			else
				FC_CAL_Bit_Low (MX_SPI_MOSI_PORT_X, MX_SPI_MOSI_PIN_X);				//Clear SDO bit

			//Clock delay
			for (i=0; i<MX_PRESCALE_VAR_X; i++)
				nop();

			//Switch clock - high for modes 0 and 3; low for modes 1 and 2
			#if ((MX_SPI_BMODE_X & 0x02) == 0x02)									//CKE = 1; (mode 0 or 2)
				#if ((MX_SPI_BMODE_X & 0x01) == 0x00)
					FC_CAL_Bit_High(MX_SPI_SCK_PORT_X, MX_SPI_SCK_PIN_X);			//CKP = 0; (mode 0)
				#else
					FC_CAL_Bit_Low(MX_SPI_SCK_PORT_X, MX_SPI_SCK_PIN_X);			//CKP = 1; (mode 2)
				#endif
			#else
				#if ((MX_SPI_BMODE_X & 0x01) == 0x00)
					FC_CAL_Bit_Low(MX_SPI_SCK_PORT_X, MX_SPI_SCK_PIN_X);			//CKP = 0; (mode 1)
				#else
					FC_CAL_Bit_High(MX_SPI_SCK_PORT_X, MX_SPI_SCK_PIN_X);			//CKP = 1; (mode 3)
				#endif
			#endif

