BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_SPI.c
			//Sample at middle of data output?
			#if ((MX_SPI_BMODE_X & 0x04) == 0)										//Sample at the middle of period
				if(FC_CAL_Bit_In(MX_SPI_MISO_PORT_X, MX_SPI_MISO_PIN_X))
					retVal = retVal | 0x01;
				else
					retVal = retVal & 0xFE;
			#endif

			//Clock delay
			for (i=0; i<MX_PRESCALE_VAR_X; i++)
				nop();

			//If mode 0 or 2, switch the clock
			#if ((MX_SPI_BMODE_X & 0x02) == 0x02)									//CKE = 1; (mode 0 or 2)
				#if ((MX_SPI_BMODE_X & 0x01) == 0x00)
					FC_CAL_Bit_Low(MX_SPI_SCK_PORT_X, MX_SPI_SCK_PIN_X);			//CKP = 0; (mode 0)
				#else
					FC_CAL_Bit_High(MX_SPI_SCK_PORT_X, MX_SPI_SCK_PIN_X);			//CKP = 1; (mode 2)
				#endif
			#endif

			//Sample at end of data output?
			#if ((MX_SPI_BMODE_X & 0x04) == 0x04)									//Sample at the end of period
				if(FC_CAL_Bit_In(MX_SPI_MISO_PORT_X, MX_SPI_MISO_PIN_X))
					retVal = retVal | 0x01;
				else
					retVal = retVal & 0xFE;
			#endif

			DataOut = DataOut << 1;							//Move to next data bit
		}
    #endif

	#if (MX_SPI_CHANNEL_X == 1)

		#ifdef SPI1BUFL
			retVal = SPI1BUFL;						// dummy read to clear flags
			SPI1BUFL = DataOut;						//send outgoing byte
		#else
			retVal = SPI1BUF;						// dummy read to clear flags
			SPI1BUF = DataOut;						//send outgoing byte
		#endif

		#ifdef SPI1STATL
			while (SPI1STATLbits.SPIRBF == 0);		//wait until data has been sent
		#else
			while (SPI1STATbits.SPIRBF == 0);		//wait until data has been sent
		#endif

		#ifdef SPI1BUFL
			retVal = SPI1BUFL;						//receive the byte
		#else
			retVal = SPI1BUF;						//receive the byte
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 2)

		#ifdef SPI2BUFL
			retVal = SPI2BUFL;						// dummy read to clear flags
			SPI2BUFL = DataOut;						//send outgoing byte
		#else
			retVal = SPI2BUF;						// dummy read to clear flags
			SPI2BUF = DataOut;						//send outgoing byte
		#endif

		#ifdef SPI2STATL
			while (SPI2STATLbits.SPIRBF == 0);		//wait until data has been sent
		#else
			while (SPI2STATbits.SPIRBF == 0);		//wait until data has been sent
		#endif

		#ifdef SPI2BUFL
			retVal = SPI2BUFL;						//receive the byte
		#else
			retVal = SPI2BUF;						//receive the byte
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 3)

		#ifdef SPI3BUFL
			retVal = SPI3BUFL;					// dummy read to clear flags
			SPI3BUFL = DataOut;					//send outgoing byte
		#else
			retVal = SPI3BUF;					// dummy read to clear flags
			SPI3BUF = DataOut;					//send outgoing byte
		#endif

		#ifdef SPI3STATL
			while (SPI3STATLbits.SPIRBF == 0);		//wait until data has been sent
		#else
			while (SPI3STATbits.SPIRBF == 0);		//wait until data has been sent
		#endif

		#ifdef SPI3BUFL
			retVal = SPI3BUFL;						//receive the byte
		#else
			retVal = SPI3BUF;						//receive the byte
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 4)

		#ifdef SPI4BUFL
			retVal = SPI4BUFL;					// dummy read to clear flags
			SPI4BUFL = DataOut;					//send outgoing byte
		#else
			retVal = SPI4BUF;					// dummy read to clear flags
			SPI4BUF = DataOut;					//send outgoing byte
		#endif

		#ifdef SPI4STATL
			while (SPI4STATLbits.SPIRBF == 0);		//wait until data has been sent
		#else
			while (SPI4STATbits.SPIRBF == 0);		//wait until data has been sent
		#endif

		#ifdef SPI4BUFL
			retVal = SPI4BUFL;						//receive the byte
		#else
			retVal = SPI4BUF;						//receive the byte
		#endif

	#endif

	return (retVal);
}


CALFUNCTION(void, FC_CAL_SPI_SetPrescaler_, (MX_UINT8 Prescaler))
{
	MX_PRESCALE_VAR_X = Prescaler;

	#if (MX_SPI_CHANNEL_X > 0)
		if (Prescaler == 0)					//1:2
			MX_PRESCALE_VAR_X = 0b11011;
		else if (Prescaler == 1)			//1:4
			MX_PRESCALE_VAR_X = 0b11110;
		else if (Prescaler == 2)			//1:6
			MX_PRESCALE_VAR_X = 0b01011;
		else if (Prescaler == 3)			//1:8
			MX_PRESCALE_VAR_X = 0b00011;
		else if (Prescaler == 4)			//1:12
			MX_PRESCALE_VAR_X = 0b10110;
		else if (Prescaler == 5)			//1:16
			MX_PRESCALE_VAR_X = 0b11101;
		else if (Prescaler == 6)			//1:20
			MX_PRESCALE_VAR_X = 0b01110;
		else if (Prescaler == 7)			//1:24
			MX_PRESCALE_VAR_X = 0b01010;
		else if (Prescaler == 8)			//1:28
			MX_PRESCALE_VAR_X = 0b00110;
		else if (Prescaler == 9)			//1:32
			MX_PRESCALE_VAR_X = 0b11001;
		else if (Prescaler == 10)			//1:48
			MX_PRESCALE_VAR_X = 0b10101;
		else if (Prescaler == 11)			//1:64
			MX_PRESCALE_VAR_X = 0b11100;
		else if (Prescaler == 12)			//1:128
			MX_PRESCALE_VAR_X = 0b11000;
		else if (Prescaler == 13)			//1:192
			MX_PRESCALE_VAR_X = 0b10100;
		else if (Prescaler == 14)			//1:256
			MX_PRESCALE_VAR_X = 0b10000;
		else if (Prescaler == 15)			//1:512
			MX_PRESCALE_VAR_X = 0b00000;
	#endif

	#if (MX_SPI_CHANNEL_X == 1)

		#ifdef SPI1STATL
			SPI1CON1bits.SPIEN = 0;								//Disable SPI peripheral
		#else
			SPI1STATbits.SPIEN = 0;								//Disable SPI peripheral
		#endif

		SPI1CON1 = SPI1CON1 & 0xFFE0;
		SPI1CON1 = SPI1CON1 | (MX_PRESCALE_VAR_X & 0x1F);		//Assign Clock Prescalers

		#ifdef SPI1STATL
			SPI1CON1bits.SPIEN = 1;								//Re-enable SPI peripheral
		#else
			SPI1STATbits.SPIEN = 1;								//Re-enable SPI peripheral
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 2)

		#ifdef SPI2STATL
			SPI2CON1bits.SPIEN = 0;								//Disable SPI peripheral
		#else
			SPI2STATbits.SPIEN = 0;								//Disable SPI peripheral
		#endif

		SPI2CON1 = SPI2CON1 & 0xFFE0;
		SPI2CON1 = SPI2CON1 | (MX_PRESCALE_VAR_X & 0x1F);		//Assign Clock Prescalers

		#ifdef SPI2STATL
			SPI2CON1bits.SPIEN = 1;								//Re-enable SPI peripheral
		#else
			SPI2STATbits.SPIEN = 1;								//Re-enable SPI peripheral
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 3)

		#ifdef SPI3STATL
			SPI3CON1bits.SPIEN = 0;								//Disable SPI peripheral
		#else
			SPI3STATbits.SPIEN = 0;								//Disable SPI peripheral
		#endif

		SPI3CON1 = SPI3CON1 & 0xFFE0;
		SPI3CON1 = SPI3CON1 | (MX_PRESCALE_VAR_X & 0x1F);		//Assign Clock Prescalers

		#ifdef SPI3STATL
			SPI3CON1bits.SPIEN = 1;								//Re-enable SPI peripheral
		#else
			SPI3STATbits.SPIEN = 1;								//Re-enable SPI peripheral
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 4)

