BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_SPI.c
		#ifdef SPI4STATL
			SPI4CON1bits.SPIEN = 0;								//Disable SPI peripheral
		#else
			SPI4STATbits.SPIEN = 0;								//Disable SPI peripheral
		#endif

		SPI4CON1 = SPI4CON1 & 0xFFE0;
		SPI4CON1 = SPI4CON1 | (MX_PRESCALE_VAR_X & 0x1F);		//Assign Clock Prescalers

		#ifdef SPI4STATL
			SPI4CON1bits.SPIEN = 1;								//Re-enable SPI peripheral
		#else
			SPI4STATbits.SPIEN = 1;								//Re-enable SPI peripheral
		#endif

	#endif
}


/**************************************************
	SPI Master Transaction based functions
**************************************************/

CALFUNCTION(MX_UINT8, FC_CAL_SPI_Transaction_Init_,   (void))
{
	CALFUNCTION(, FC_CAL_SPI_Master_Init_, ());
	return 1;	// Success
}

CALFUNCTION(MX_UINT8, FC_CAL_SPI_Transaction_,   (MX_UINT8* Buffer, MX_UINT16 Size, MX_UINT16 Length))
{
	if (Length > Size) return 0;
	MX_UINT16 n = 0;
	while (n < Length)
	{
		Buffer[n] = CALFUNCTION(, FC_CAL_SPI_Master_Byte_, (Buffer[n]));
		++n;
	}
	return 1;		// Success
}

CALFUNCTION(void, FC_CAL_SPI_Transaction_Uninit_, (void))
{
	CALFUNCTION(, FC_CAL_SPI_Master_Uninit_, ());
}


#endif		//End of Master





#if (MX_SPI_SLAVE_X == 1)		//Slave Start

CALFUNCTION(void, FC_CAL_SPI_Slave_Init_, (void))
{
	FC_CAL_Bit_High_DDR (MX_SPI_MOSI_PORT_X, MX_SPI_MOSI_TRIS_X, MX_SPI_MOSI_PIN_X);		// MOSI pin is default high
	FC_CAL_Bit_In_DDR   (MX_SPI_MISO_PORT_X, MX_SPI_MISO_TRIS_X, MX_SPI_MISO_PIN_X);		// MISO pin is a input
	FC_CAL_Bit_In_DDR   (MX_SPI_SCK_PORT_X, MX_SPI_SCK_TRIS_X, MX_SPI_SCK_PIN_X);			// Clock pin is a input
	#if (MX_SPI_USESS_X == 1)
		FC_CAL_Bit_In_DDR   (MX_SPI_SS_PORT_X, MX_SPI_SS_TRIS_X, MX_SPI_SS_PIN_X);			// SS pin is a input
	#endif

	#if (MX_SPI_REMAPPABLE_X == 1)									//Remappable I/O
		MX_SPI_MISO_RPINR_X = MX_SPI_MISO_RP_X;						//Data In
		MX_SPI_MOSI_RPOR_X = MX_SPI_MOSI_SDO_X;						//Data Out
		MX_SPI_CLK_RPINR_X = MX_SPI_CLK_RP_X;						//Clock In
		#if (MX_SPI_USESS_X == 1)
			MX_SPI_SS_RPINR_X = MX_SPI_SS_RP_X;						//SS In
		#endif
	#endif

	#if (MX_SPI_SS_ALT_X == 1)										//Alt SS Pin
		MX_SPI_SS_REG_X |= MX_SPI_SS_MSK_X;							//Enable alternate SS pin
	#endif

	#if (MX_SPI_CHANNEL_X == 1)

		SPI1CON1bits.MSTEN = 0;									//Slave mode
		SPI1CON1bits.CKP = MX_SPI_BMODE_X & 0x01;				//Assign Clock Polarity
		SPI1CON1bits.CKE = (MX_SPI_BMODE_X & 0x02) >> 1;		//Assign Clock Phase
		SPI1CON1bits.SMP = (MX_SPI_BMODE_X & 0x04) >> 2;		//Assign Input Data Phase

		#ifdef SPI1BUFL
			SPI1BUFL = 0;										//Clear outgoing byte
		#else
			SPI1BUF = 0;										//Clear outgoing byte
		#endif

		#if (MX_SPI_USESS_X == 1)
			SPI1CON1bits.SSEN = 1;								//Assign Slave Mode - Use SS Pin - Active Low
		#else
			SPI1CON1bits.SSEN = 0;								//Assign Slave Mode - No SS Pin
		#endif

		#ifdef SPI1STATL
			SPI1STATLbits.SPIROV = 0;							//clear unread data flag
			SPI1CON1bits.SPIEN = 1;								//enable SPI peripheral
		#else
			SPI1STATbits.SPIROV = 0;							//clear unread data flag
			SPI1STATbits.SPIEN = 1;								//enable SPI peripheral
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 2)

		SPI2CON1bits.MSTEN = 0;									//Slave mode
		SPI2CON1bits.CKP = MX_SPI_BMODE_X & 0x01;				//Assign Clock Polarity
		SPI2CON1bits.CKE = (MX_SPI_BMODE_X & 0x02) >> 1;		//Assign Clock Phase
		SPI2CON1bits.SMP = (MX_SPI_BMODE_X & 0x04) >> 2;		//Assign Input Data Phase

		#ifdef SPI2BUFL
			SPI2BUFL = 0;										//Clear outgoing byte
		#else
			SPI2BUF = 0;										//Clear outgoing byte
		#endif

		#if (MX_SPI_USESS_X == 1)
			SPI2CON1bits.SSEN = 1;								//Assign Slave Mode - Use SS Pin - Active Low
		#else
			SPI2CON1bits.SSEN = 0;								//Assign Slave Mode - No SS Pin
		#endif

		#ifdef SPI2STATL
			SPI2STATLbits.SPIROV = 0;							//clear unread data flag
			SPI2CON1bits.SPIEN = 1;								//enable SPI peripheral
		#else
			SPI2STATbits.SPIROV = 0;							//clear unread data flag
			SPI2STATbits.SPIEN = 1;								//enable SPI peripheral
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 3)

		SPI3CON1bits.MSTEN = 0;									//Slave mode
		SPI3CON1bits.CKP = MX_SPI_BMODE_X & 0x01;				//Assign Clock Polarity
		SPI3CON1bits.CKE = (MX_SPI_BMODE_X & 0x02) >> 1;		//Assign Clock Phase
		SPI3CON1bits.SMP = (MX_SPI_BMODE_X & 0x04) >> 2;		//Assign Input Data Phase

		#ifdef SPI3BUFL
			SPI3BUFL = 0;										//Clear outgoing byte
		#else
			SPI3BUF = 0;										//Clear outgoing byte
		#endif

		#if (MX_SPI_USESS_X == 1)
			SPI3CON1bits.SSEN = 1;								//Assign Slave Mode - Use SS Pin - Active Low
		#else
			SPI3CON1bits.SSEN = 0;								//Assign Slave Mode - No SS Pin
		#endif

		#ifdef SPI3STATL
			SPI3STATLbits.SPIROV = 0;							//clear unread data flag
			SPI3CON1bits.SPIEN = 1;								//enable SPI peripheral
		#else
			SPI3STATbits.SPIROV = 0;							//clear unread data flag
			SPI3STATbits.SPIEN = 1;								//enable SPI peripheral
		#endif

	#endif

	#if (MX_SPI_CHANNEL_X == 4)

		SPI4CON1bits.MSTEN = 0;									//Slave mode
		SPI4CON1bits.CKP = MX_SPI_BMODE_X & 0x01;				//Assign Clock Polarity
		SPI4CON1bits.CKE = (MX_SPI_BMODE_X & 0x02) >> 1;		//Assign Clock Phase
		SPI4CON1bits.SMP = (MX_SPI_BMODE_X & 0x04) >> 2;		//Assign Input Data Phase

		#ifdef SPI4BUFL
			SPI4BUFL = 0;										//Clear outgoing byte
		#else
			SPI4BUF = 0;										//Clear outgoing byte
		#endif

		#if (MX_SPI_USESS_X == 1)
			SPI4CON1bits.SSEN = 1;								//Assign Slave Mode - Use SS Pin - Active Low
		#else
			SPI4CON1bits.SSEN = 0;								//Assign Slave Mode - No SS Pin
		#endif

		#ifdef SPI4STATL
			SPI4STATLbits.SPIROV = 0;							//clear unread data flag
			SPI4CON1bits.SPIEN = 1;								//enable SPI peripheral
		#else
			SPI4STATbits.SPIROV = 0;							//clear unread data flag
			SPI4STATbits.SPIEN = 1;								//enable SPI peripheral
		#endif

	#endif

}

CALFUNCTION(void, FC_CAL_SPI_Slave_Uninit_, (void))
{
	#if (MX_SPI_CHANNEL_X == 1)
		#ifdef SPI1STATL
			SPI1CON1bits.SPIEN = 0;								//disable SPI peripheral
		#else
			SPI1STATbits.SPIEN = 0;								//disable SPI peripheral
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 2)
		#ifdef SPI2STATL
			SPI2CON1bits.SPIEN = 0;								//disable SPI peripheral
		#else
			SPI2STATbits.SPIEN = 0;								//disable SPI peripheral
		#endif
	#endif

