BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_SPI.c
	#if (MX_SPI_CHANNEL_X == 3)
		#ifdef SPI3STATL
			SPI3CON1bits.SPIEN = 0;								//disable SPI peripheral
		#else
			SPI3STATbits.SPIEN = 0;								//disable SPI peripheral
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 4)
		#ifdef SPI4STATL
			SPI4CON1bits.SPIEN = 0;								//disable SPI peripheral
		#else
			SPI4STATbits.SPIEN = 0;								//disable SPI peripheral
		#endif
	#endif

	//Reset Pins to Inputs
	FC_CAL_Bit_In_DDR (MX_SPI_MOSI_PORT_X, MX_SPI_MOSI_TRIS_X, MX_SPI_MOSI_PIN_X);
	FC_CAL_Bit_In_DDR (MX_SPI_MISO_PORT_X, MX_SPI_MISO_TRIS_X, MX_SPI_MISO_PIN_X);
	FC_CAL_Bit_In_DDR (MX_SPI_SCK_PORT_X, MX_SPI_SCK_TRIS_X, MX_SPI_SCK_PIN_X);
}

CALFUNCTION(void, FC_CAL_SPI_Slave_TxByte_, (MX_UINT8 Data))
{
	#if (MX_SPI_CHANNEL_X == 1)
		#ifdef SPI1BUFL
			SPI1BUFL = Data;				//Specify outgoing byte
		#else
			SPI1BUF = Data;					//Specify outgoing byte
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 2)
		#ifdef SPI2BUFL
			SPI2BUFL = Data;				//Specify outgoing byte
		#else
			SPI2BUF = Data;					//Specify outgoing byte
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 3)
		#ifdef SPI3BUFL
			SPI3BUFL = Data;				//Specify outgoing byte
		#else
			SPI3BUF = Data;					//Specify outgoing byte
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 4)
		#ifdef SPI4BUFL
			SPI4BUFL = Data;				//Specify outgoing byte
		#else
			SPI4BUF = Data;					//Specify outgoing byte
		#endif
	#endif
}

CALFUNCTION(MX_UINT8, FC_CAL_SPI_Slave_RxByte_, (void))
{
	MX_UINT8 retVal = 0;

	#if (MX_SPI_CHANNEL_X == 1)
		#ifdef SPI1BUFL
			retVal = SPI1BUFL;				//Collect incoming byte
		#else
			retVal = SPI1BUF;				//Collect incoming byte
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 2)
		#ifdef SPI2BUFL
			retVal = SPI2BUFL;				//Collect incoming byte
		#else
			retVal = SPI2BUF;				//Collect incoming byte
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 3)
		#ifdef SPI3BUFL
			retVal = SPI3BUFL;				//Collect incoming byte
		#else
			retVal = SPI3BUF;				//Collect incoming byte
		#endif
	#endif

	#if (MX_SPI_CHANNEL_X == 4)
		#ifdef SPI4BUFL
			retVal = SPI4BUFL;				//Collect incoming byte
		#else
			retVal = SPI4BUF;				//Collect incoming byte
		#endif
	#endif

	return(retVal);
}


#endif			//Slave End


#undef MX_SPI_PR_SCALE_X
